; domain
(define (domain coffee-shop)

  ;; define types
  (:types
    robot customer table barcounter
    drink
    cold-drink - drink
    warm-drink - drink)

  ;; define constants
  (:constants
    barista - robot1
    waiter - robot2
    cold-drink - cold-drink
    warm-drink - warm-drink
    table-1 - table
    table-2 - table
    table-3 - table
    table-4 - table
    main - barcounter)

  ;; define predicates
  (:predicates
    (order-placed ?c - customer ?d - drink)
    (drink-ready ?d - drink)
    (drink-served ?c - customer ?d - drink ?t - table)
    (tray-in-use)
    (tray-with-drinks)
    (cleaned ?t - table))

  ;; define cost function
  (:functions
    (total-cost))

  ;; define actions
  (:action prepare-cold-drink
    :parameters (?b - robot1 ?d - cold-drink )
    :precondition (and (not (drink-ready ?d))
                       (not (tray-in-use)) )
    :effect (and (drink-ready ?d)
                 (increase (total-cost) 1)))

  (:action prepare-warm-drink
    :parameters (?b - robot1 ?d - warm-drink)
    :precondition (and (not (drink-ready ?d))
                       (not (tray-in-use)))
    :effect (and (drink-ready ?d)
                 (increase (total-cost) 2)))

  (:action pickup-drink
    :parameters (?w - robot2 ?d - drink) 
    :precondition (and (drink-ready ?d)
                       (not (tray-in-use)))
    :effect (and (not (drink-ready ?d))
                      (tray-with-drinks)
                 (increase (total-cost) 1)))

  (:action pickup-tray
    :parameters (?w - robot2 ?m - table)
    :precondition (and (not (tray-in-use))
                       )
    :effect (and (tray-in-use)
                 (increase (total-cost) 1)))

  (:action pick-serve-return
    :parameters (?b - robot1 ?w - robot2 ?c - customer ?d - drink ?t - table ?m - barcounter )
    :precondition (and (not (drink-served ?c ?d ?t))
                       (drink-ready ?d)
                       (tray-with-drinks))
    :effect (and (drink-served ?c ?d ?t)
                 (not (drink-ready ?d))
                 (not (tray-with-drinks))
                 (increase (total-cost) 3)))
                 
   

  (:action clean-table
   :parameters (?w - robot2 ?t - table)
   :precondition (not (cleaned ?t))
   :effect (and (cleaned ?t)
                (increase (total-cost) 1))))

; problem
(define (problem coffee-shop-problem-1)
  (:domain coffee-shop)

  ;; define objects
  (:objects
    customer-1 - customer
    customer-2 - customer
    cold-drink-1 - cold-drink
    cold-drink-2 - cold-drink
    table-2 - table
    table-3 - table
    table-4 - table)

  ;; define initial state
  (:init
    (order-placed customer-1 cold-drink-1)
    (order-placed customer-2 cold-drink-2)
    (not (prepare-warm-drink))
   
    (not (tray-in-use))
    (not (tray-with-drinks))
    (= (total-cost) 0))

  ;; define goal state
  (:goal
    (and
      (drink-served customer-1 cold-drink-1 table-2)
      (drink-served customer-2 cold-drink-2 table-2)
      (cleaned table-3)
      (cleaned table-4)))
      
  ;; define cost function
  (:metric minimize (total-cost)))

; plan
1. (clean-table waiter table-3)
   added: (cleaned table-3)
   goals met: 1 of 4
2. (clean-table waiter table-4)
   added: (cleaned table-4)
   goals met: 2 of 4
3. (prepare-cold-drink barista cold-drink-1)
   added: (drink-ready cold-drink-1)
   goals met: 2 of 4
4. (prepare-cold-drink barista cold-drink-2)
   added: (drink-ready cold-drink-2)
   goals met: 2 of 4
5. (prepare-cold-drink barista cold-drink)
   added: (drink-ready cold-drink)
   goals met: 2 of 4
6. (pickup-drink waiter cold-drink-2)
   deleted: (drink-ready cold-drink-2)
   added: (tray-with-drinks)
   goals met: 2 of 4
7. (prepare-cold-drink barista cold-drink-2)
   added: (drink-ready cold-drink-2)
   goals met: 2 of 4
8. (pick-serve-return barista waiter customer-2 cold-drink-2 table-2 main)
   deleted: (drink-ready cold-drink-2) (tray-with-drinks)
   added: (drink-served customer-2 cold-drink-2 table-2)
   goals met: 3 of 4
9. (pickup-drink waiter cold-drink)
   deleted: (drink-ready cold-drink)
   added: (tray-with-drinks)
   goals met: 3 of 4
10. (pick-serve-return barista waiter customer-1 cold-drink-1 table-2 main)
   deleted: (drink-ready cold-drink-1) (tray-with-drinks)
   added: (drink-served customer-1 cold-drink-1 table-2)
   goals met: 4 of 4
